StartTrip/src/main/webapp/callxml/BargainFinderMaxRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
   <SOAP-ENV:Header>
      <eb:MessageHeader SOAP-ENV:mustUnderstand="1" eb:version="1.0">
         <eb:From>
            <eb:PartyId type="urn:x12.org:IO5:01">99999</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>2009-06-0249586768</eb:ConversationId>
         <eb:Service eb:type="AWS">BargainFinderMaxRQ</eb:Service>
         <eb:Action>BargainFinderMaxRQ</eb:Action>
         <eb:MessageData>
            <eb:MessageId>mid:20001209-133003-2333@clientofsabre.com</eb:MessageId>
            <eb:Timestamp>2001-02-15T11:15:12Z</eb:Timestamp>
            <eb:TimeToLive>2001-02-15T11:15:12Z</eb:TimeToLive>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">
         <wsse:BinarySecurityToken>{{{BinarySecurityToken}}}</wsse:BinarySecurityToken>         
      </wsse:Security>			   
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <OTA_AirLowFareSearchRQ xmlns="http://www.opentravel.org/OTA/2003/05" Version="3.0.0" ResponseType="OTA" ResponseVersion="3.0.0">
         <POS>
            <Source PseudoCityCode="A2U8">
               <RequestorID Type="1" ID="1">
                  <CompanyName Code="TN">TN</CompanyName>
               </RequestorID>
            </Source>
         </POS>
         <OriginDestinationInformation RPH="1">
            <DepartureDateTime>{{{出發時間}}}</DepartureDateTime>
            <OriginLocation LocationCode="{{{出發地點}}}" LocationType="C"/>
            <DestinationLocation LocationCode="{{{抵達地點}}}" LocationType="C"/>
            <TPA_Extensions>
               <SegmentType Code="O"/>
            </TPA_Extensions>
         </OriginDestinationInformation>
         <OriginDestinationInformation RPH="2">
            <DepartureDateTime>{{{回程時間}}}</DepartureDateTime>
            <OriginLocation LocationCode="{{{出發地點}}}" LocationType="C"/>
            <DestinationLocation LocationCode="{{{抵達地點}}}" LocationType="C"/>
            <TPA_Extensions>
               <SegmentType Code="O"/>
            </TPA_Extensions>
         </OriginDestinationInformation>
         <TravelPreferences ValidInterlineTicket="true">
            <CabinPref Cabin="{{{艙等}}}" PreferLevel="Preferred"/>
            <TPA_Extensions>
               <TripType Value="Return"/>
               <ExcludeCallDirectCarriers Enabled="true"/>
            </TPA_Extensions>
            <Baggage RequestType="C" Description="true"/>
         </TravelPreferences>
	<TravelerInfoSummary>
		<AirTravelerAvail>
			<PassengerTypeQuantity Code="ADT" Quantity="{{{大人數}}}"/>
			<PassengerTypeQuantity Code="CNN" Quantity="{{{小孩數}}}"/>
		</AirTravelerAvail>
		<PriceRequestInformation CurrencyCode="TWD"/>
	</TravelerInfoSummary>
         <TPA_Extensions>
            <IntelliSellTransaction>
               <RequestType Name="200ITINS"/>
               <CompressResponse Value="true"/>
            </IntelliSellTransaction>
         </TPA_Extensions>
      </OTA_AirLowFareSearchRQ>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>